.config/emacs/init.org
#+title: Emacs config file
#+PROPERTY: header-args:emacs-lisp :tangle yes :mkdirp yes

* Preamble

This is an org-mode file that is used in the creation of emacs [[file:init.el][init.el]] file

This is for the .el file
#+begin_src emacs-lisp :tangle yes

      ;; Garbage Collection
    (setq gc-cons-threshold (* 50 1000 1000))
	  ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
	  ;;       in Emacs and init.el will be generated automatically!
(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src

** Some informaion
I will Document this as well as I can including links to the projects

* Setting up the Package System
Emacs is a very customizable program and part of that is packages that you can install we will start by setting this up [[https://github.com/jwiegley/use-package][use-package]]

#+begin_src emacs-lisp :tangle yes 
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

** No Littering to keep the configuration file clean
#+begin_src emacs-lisp :tangle yes
;; NOTE: If you want to move everything out of the ~/.emacs.d folder
;; reliably, set `user-emacs-directory` before loading no-littering!
;(setq user-emacs-directory "~/.cache/emacs")

(use-package no-littering)

;; no-littering doesn't set this by default so we must place
;; auto save files in the same path as it uses for sessions
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src
* Basic UI Setup

This makes the Emacs UI look more modern as well as better usability

#+begin_src emacs-lisp :tangle yes
    ;; Disables the startup message
    (setq inhibit-startup-message t)

    (scroll-bar-mode -1)        ; Disable visible scrollbar
    (tool-bar-mode -1)          ; Disable the toolbar
    (tooltip-mode -1)           ; Disable tooltips
    (set-fringe-mode 10)        ; Give some breathing room
    (menu-bar-mode -1)            ; Disable the menu bar

      ;; Set up the visible bell
      (setq visible-bell t)

      (set-face-attribute 'default nil :font "Monoid Nerd Font" :height 100)
      (visual-line-mode t)

      ;; Make ESC quit prompts
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

      (column-number-mode)
      (global-display-line-numbers-mode t)

      ;;Disable line numbers for some modes
      (dolist (mode '(org-mode-hook
                      term-mode-hook
                        treemacs-mode-hook
                      shell-mode-hook
		        vterm-hook
                      eshell-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src
** Keeps the init file from getting emacs auto generated lines added that would get overridden latter
#+begin_src emacs-lisp :tangle yes
;; Move custom-set-varialbes to new file
(setq custom-file (concat user-emacs-directory "custom.el"))
(load custom-file 'noerror)
#+end_src

* UI packages
These are Packages that are mainly for the UI 
** DOOM Themes
This is a Repository of emacs themes that were created for DOOM emacs but can be used for our purpeses [[https://github.com/karetsu/emacs-doom-themes][Doom Themes]]
#+begin_src emacs-lisp :tangle yes
;; Install doom themes
(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-dracula t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)
  
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(load-theme 'doom-dracula)
#+end_src

** DOOM Modeline
This is a fancy minimal modeline for emacs [[https://github.com/seagle0128/doom-modeline][Doom Modeline]]
#+begin_src emacs-lisp :tangle yes
;; Install better bottom bar
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))
#+end_src
** All the Icons
*First time you must use* M-x all-the-icons-install-fonts In order to install the icons [[https://github.com/domtronn/all-the-icons.el][all-the-icons]] + [[https://github.com/jtbm37/all-the-icons-dired][all-the-icons-dired]]
#+begin_src emacs-lisp :tangle yes
;; Icons you have to run M-x all-the-icons-install-fonts
(use-package all-the-icons)
; :if (display-graphics-p)
; :commands (all-the-icons-install-fonts))
 ; :init
 ; (unless (find-font (font-spec :name "all-the-icons"))
 ;   (all-the-icoons-install-fonts t)))
(use-package all-the-icons-dired
 ; :if (display-graphics-p)
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
** Rainbow delimiters
or rainbow parentheses. this will make it easer to see which opening and closing parentheses are for which to help make sure that they match [[https://github.com/Fanael/rainbow-delimiters][rainbow delimiters]]
#+begin_src emacs-lisp :tangle yes
;; Rainbow Delimiters aka colorful ()
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Beacon
this is desighned to make your curser blink when scrolling so you don't loose it [[https://github.com/Malabarba/beacon][beacon]]
#+begin_src emacs-lisp :tangle yes
;; Keep track of the curser while scrolling
(use-package beacon)
(beacon-mode t)
#+end_src

* Emacs Improvements
These are improvements for searching everything from files to keybindings
** Ivy
This is a interactive interface for emacs completion [[https://oremacs.com/swiper/][swiper ivy]]
#+begin_src emacs-lisp :tangle yes
;; Better search and mini buffer
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src
** Ivy rich
Better UI for IVY and counsel [[https://github.com/Yevgnen/ivy-rich][Ivy Rich]]
#+begin_src emacs-lisp :tangle yes
  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))
#+end_src
** Counsel
This helps find common emacs commands [[https://github.com/abo-abo/swiper#counsel][counsel]]
#+begin_src emacs-lisp :tangle yes
;; Better M-x and search
(use-package counsel
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^
#+end_src
** Which key
This is show what keybidings are attached to certain commands [[https://github.com/justbur/emacs-which-key][which key]]
#+begin_src emacs-lisp :tangle yes
  ;; shows keybindings and what they use
  (use-package which-key
  :defer 0
    ; :init (which-key-mode)
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.3)) ; time delay for popups
#+end_src
** Helpful
this is a better help program than the one built into emacs [[https://github.com/Wilfred/helpful][helpful]]
#+begin_src emacs-lisp :tangle yes
  ;; Better help program
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src
** general
better keybindings [[https://github.com/noctuid/general.el][general]]
#+begin_src emacs-lisp :tangle yes
(use-package general
 :config
  (general-evil-setup t)

(general-create-definer rune/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
(rune/leader-keys
  "t" '(:ignore t :which-key "toggles")
  "tt" '(counsel-load-theme :which-key "choose theme")))

(general-define-key
 "C-M-j" 'counsel-switch-buffer)
#+end_src
** Hydra
more keybindings but on a short timer [[https://github.com/abo-abo/hydra][hydra]]
#+begin_src emacs-lisp :tangle yes
  (use-package hydra
    :defer t) 
    
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (rune/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src
